app/views/charts/_chart.html.erb


<% if chart.dashboards.any? %>
---
SELECT  1 AS one FROM "dashboards" INNER JOIN "charts_dashboards" ON "dashboards"."id" = "charts_dashboards"."dashboard_id" WHERE "charts_dashboards"."chart_id" = $1 LIMIT 1  [["chart_id", 7]]
SELECT "dashboards".* FROM "dashboards" INNER JOIN "charts_dashboards" ON "dashboards"."id" = "charts_dashboards"."dashboard_id" WHERE "charts_dashboards"."chart_id" = $1  [["chart_id", 7]]