app/views/charts/show.json.jbuilder


json.chart @chart.datapoints.group(:x).sum(:y)
---
SELECT  "charts".* FROM "charts"  WHERE "charts"."id" = $1 LIMIT 1  [["id", 4]]
SELECT "datapoints".* FROM "datapoints"  WHERE "datapoints"."chart_id" = $1  [["chart_id", 4]]
SELECT SUM("datapoints"."y") AS sum_y, x AS x FROM "datapoints"  WHERE "datapoints"."chart_id" = $1 GROUP BY x  [["chart_id", 4]]