app/controllers/charts_controller.rb

INSERT INTO "datapoints" ("chart_id", "created_at", "series_id", "updated_at", "x", "y") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["chart_id", 10], ["created_at", "2014-04-30 19:19:29.001336"], ["series_id", 1], ["updated_at", "2014-04-30 19:19:29.001336"], ["x", "US"], ["y", 10.0]]
---
  def create
    @chart = Chart.new params[:chart].permit(:name, :chart_type, :csv)
    if @chart.save
      @chart.create_datapoints @chart.csv.path

SELECT SUM("datapoints"."y") AS sum_y, x AS x FROM "datapoints"  WHERE "datapoints"."chart_id" = $1 GROUP BY x  [["chart_id", 4]]
---
  def json
    render json: @chart.datapoints.group(:x).sum(:y)