app/controllers/charts_controller.rb

  def create
    @chart = Chart.new params[:chart].permit(:name, :chart_type, :csv, :dashboard_titles, :colorscheme)
    @chart.user = current_user
    if @chart.save
---
INSERT INTO "charts" ("chart_type", "created_at", "name", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["chart_type", 0], ["created_at", "2014-04-25 16:05:54.424932"], ["name", ""], ["updated_at", "2014-04-25 16:05:54.424932"]]
INSERT INTO "dashboards" ("created_at", "title", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["created_at", "2014-04-30 13:10:27.781287"], ["title", "uk"], ["updated_at", "2014-04-30 13:10:27.781287"]]
INSERT INTO "series" ("chart_id", "created_at", "name", "order", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["chart_id", 10], ["created_at", "2014-04-30 19:19:28.966086"], ["name", "rainfall"], ["order", 1], ["updated_at", "2014-04-30 19:19:28.966086"]]

  def show
    @chart = Chart.find params[:id]
    respond_to do |format|
      if @chart.pie_chart?
        format.json {render json: @chart.datapoints.group(:x).sum(:y) }
      else
        format.json { render json: @chart.series.reverse.map { |series|
---
SELECT  "charts".* FROM "charts"  WHERE "charts"."id" = $1 LIMIT 1  [["id", 3]]
SELECT  "datapoints".* FROM "datapoints"  WHERE "datapoints"."chart_id" = $1  ORDER BY "datapoints"."id" DESC LIMIT 1  [["chart_id", 4]]
SELECT SUM("datapoints"."y") AS sum_y, x AS x FROM "datapoints"  WHERE "datapoints"."chart_id" = $1 GROUP BY x  [["chart_id", 5]]
SELECT "series".* FROM "series"  WHERE "series"."chart_id" = $1  [["chart_id", 7]]
SELECT SUM("datapoints"."y") AS sum_y, x AS x FROM "datapoints"  WHERE "datapoints"."series_id" = $1 GROUP BY x  [["series_id", 1]]

  def index
    @charts = Chart.all
---
SELECT "charts".* FROM "charts"

  def destroy
    @chart = Chart.find params[:id]
    @chart.destroy
---
SELECT  "charts".* FROM "charts"  WHERE "charts"."id" = $1 LIMIT 1  [["id", 14]]
DELETE FROM "charts" WHERE "charts"."id" = $1  [["id", 14]]