app/controllers/dashboards_controller.rb

  def show
    @dashboard = Dashboard.find params[:id]
---
SELECT  "dashboards".* FROM "dashboards"  WHERE "dashboards"."id" = $1 LIMIT 1  [["id", 2]]