app/controllers/widgets_controller.rb

SELECT  "charts".* FROM "charts"  WHERE "charts"."id" = $1 LIMIT 1  [["id", 10]]
---
  def show
  	@chart = Chart.find(params[:chart_id])